A circle can't be converted to multiplanar shape.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CircleMultiPlanarShape { get; }
  Visual Basic
Public Shared ReadOnly Property CircleMultiPlanarShape As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CircleMultiPlanarShape {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures RebarShapeFailures Class
  Autodesk.Revit.DB Namespace